var mongoose = require('mongoose')

var drugSchema = new mongoose.Schema({
	name: {type: String, required: true},
	shelfLife: {type: Number, required: true},
	cost: {type: Number, required: true, min: 0},
	pack: {type: String, required: true},
	actSubstance: {type: String, required: true},
	analogs: {type: [String], required: true},
	manual: {type: String, required: true},
	pharmGroup: {type: String, required: true},
	regDate: {type: Date, required: true, "default": new Date()},
	img: Buffer
});

var directorySchema = new mongoose.Schema({
	customId: String,
	title: {type: String, required: true},
	editDate: Date,
	editUser: String,
	drugs: [drugSchema]
});

mongoose.model('Directory', directorySchema, 'directory');


/*
5ae04963fde38aba3b0d1c6d

db.directory.save({
	title: 'Довiдник препаратiв',
	customId: 'directory',
	editDate: new Date(),
	editUser: 'Карпович О.Г.',
	drugs: [{
		_id: new ObjectId(),
		name: 'Анальгін',
		shelfLife: 365,
		cost: 20,
		pack: 'Блiстер',
		actSubstance: 'Анальгiн',
		parmGroup: 'Аналгетики-антипіретики',
		analogs: ['Анальдим', 'Андипал', 'Беналгін', 'Кофальгін'],
		manual: 'Інструкція'
	}]
})
*/
// Показання. Больовий синдром малої і середньої інтенсивності різного походження і локалізації (головний, зубний біль, опіки, біль в після операційному періоді, дисменорея, артралгії, невралгії, радикуліти, міозити); гіпертермічний синдром, гарячкові стани (при грипі, гострих респіраторних та інших інфекціях); ниркова і печінкова коліки (у комбінації із спазмолітичними засобами).
// Протипоказання. Гіпер чутливість до компонентів препарату. Агранулоцит оз, цитостатична або інфекційна нейтропенія. Печінкова і/або ниркова недостатність. Спадкова гемолітична анемія, пов’язана з дефіцитом глюкозо-6-фосфатдегідрогенази. Напади бронхіальної астми, викликаної ацетил саліциловою кислотою. Анемія, лейкопенія, вагітність (особливо в I триместрі і в останні 6 тижнів). Період лактації. Період новонародженості (до 3 міс). Захворювання нирок: пієлонефрит, гломерулонефрит – в т. ч. в анамнезі. Не можна вводити внутрішньо венно   хворим із систолічним артеріальним   тиском нижче 100 мм рт. ст. Полі травма.   Шок.
// Спосіб застосування та дози. Дорослим препарат вводять внутрішньом’язово або внутрішньо венно у разі малого або середнього по інтенсивності болю   по 1-2 мл 25% або 50% розчину 2-3 рази на добу, але сумарно не більше 1 г разово або 2 г за добу. Підшкірні ін’єкції болючі, тому що метамізол натрію має локальну подразливу дію. Тривалість лікування до 3 діб.
// Побічна дія. З боку сечовивідної системи: порушення функції нирок, олігурія, анурія, протеїнурія, інтерстиціальний нефрит, забарвлення сечі в червоний колір. Алергічні реакції: кропив’янка (в т. ч. на кон’юнктиві і слизових оболонках носоглотки), ангіо невротичний набряк, в окремих випадках – злоякісна ексудативна еритема (синдром Стівенса-Джонсона), токсичний епідермальний некроліз (синдром Лайелла), бронхоспастичний синдром, анафілактичний шок. З боку органів кровотворення: агранулоцит оз, лейкопенія, тромбоцит опенія. Інші: зниження артеріального тиску.   Місцеві реакції: при внутрішньом’язовому   введенні можливі інфільтрати в місці введення